{
  "chapters": [
    {
      "id": "chapter-1754800547639",
      "title": "Chapter 1: Ice Beneath Our Feet",
      "volume": "Volume 1",
      "content": "\nIn Oris, the cold had teeth.\nIt wasn't the kind of snow people in stories laughed under, the kind you saw in holovids with children tumbling through flakes. This cold didn’t play. It hunted. It found the cracks in your boots, chewed through your coat seams, and burrowed into your bones. Cael Rhane had grown up with it, but no number of Years ever made it familiar. This morning was no different. He sat hunched on the edge of his cot, wrapped in a scratchy blanket, watching his breath coil in the pale air. The radiator clinked in the corner like it was struggling for life, coughing out a lukewarm sigh before giving up again. Above, frost webbed the inside of the window.\nHe’d looked for the Moon last night, as he always did. But the sky had been empty—no cloud cover, no light, just stars. Three nights now, and nothing. Maybe the cold was playing tricks again. Still, it left a strange weight in his gut.\nHe hated this day before it even started.\nEighteen. He whispered it to himself without a trace of feeling. It didn’t feel like anything had changed. The same room, the same aching cold, the same silence pressing against the walls.\nFootsteps padded outside his door, soft, practiced. Nyra. She didn’t walk so much as drift, as if afraid of disturbing something deeper than sleep.\n“You’re up early,” she said as she stepped inside, a soft blue scarf wrapped loosely around her like a river of warmth in the frozen gloom.\n“Didn’t sleep,” Cael muttered, his voice low and gravelly, like the words were dragged out against his will.\nShe didn’t ask why. She didn’t need to.\nShe pressed a cup into his hands, the metal warm against his fingers. Salt-broth. He could smell the garlic... and something vaguely like meat.\n“You dreamed of the mines again.”\nHe nodded and took a sip. “I don’t want to,” he said, voice hushed. “But I’m not given a choice.”\nIt burned going down, but it was a good burn. Familiar. Real.\n“You’ll get used to it. We all do.”\nCael let out a dry chuckle. “That sounds like a threat.”\nShe didn’t smile. “It’s not.”\nHe ate quietly by the cot, the ceramic bowl balanced on his knees. The firelight made Nyra’s face look older, shadowed in sharp edges. She’d always looked tired, but lately, it felt like she was wearing it like armor.\n“You’ll see Dad before noon,” she said after a while. “Maybe Depot briefing. First badge. New boots.”\n“He’ll act like it’s a ceremony. He always does,” Cael muttered, shrugging it off.\nNyra nudged the mood with a grin. “Do you remember a few months back, my first day in the mines? He made everything so damn hard?”\nCael chuckled, the sound surprising even him. “Yeah. You almost missed your call because of that.”\nThen, after a pause, he looked at her.\n“If my parents were here,” he asked softly, “do you think they would’ve given me a choice?”\nNyra’s smile faded. Her voice dropped into something heavier.\n“It’s not about them,” she said. “It’s the community rule. No one gets a choice. Not when they turn eighteen. You report to the mines, or you don’t stay here.”\nThe silence stretched between them, broken only by the soft hiss of a pipe nearby—somewhere above, vapor leaked in a steady, ghostlike stream.\nFor a moment, neither of them moved. The weight of the morning, the weight of eighteen, hung in the air like frost.\nThen Nyra shifted, brushing the ends of her scarf behind her shoulder. “I should head to the market,” she said quietly. “We're low on supplies... and Dad’ll be home soon.”\nShe hesitated at the door, as if she wanted to say something more, but didn’t. The door clicked shut behind her.\nCael sat there a while longer, staring at the frost collecting near the window’s edge. The room felt smaller than usual. Tighter. Colder.\nEventually, the silence pushed him outside.\nCael sat on the edge of a Worker Tier rooftop, boots dangling over the ledge, the metal cold beneath him. From up here, the whole housing stack unfolded like a puzzle box layered, compressed, and exhausted.\nTheir community wasn’t built to feel like home. It was built to function.\nThe base was the Smokestack Tier, where old ducts and rusted exhaust vents choked out plumes of heat and whatever passed for air. You didn’t live there—you worked through it, shuffled through it, breathed it in until your lungs learned to stop complaining.\nThe middle, where Cael lived, was the Worker Tier: single-room modules packed together like shipping crates, walls heated by tangled pipe systems that groaned when you leaned against them. The lavatories were communal. Privacy was a myth.\nThe top, the Overlook Cabins, were the closest thing to luxury this place offered. Dome-glass windows. Private stair access. Real alarms if the power failed, not just distant sirens. Those cabins hugged the central generator core like royalty clinging to firelight.\nYou could tell how important someone was by how close their door stood to the warmth. Cael had seen it his whole life. Still didn’t feel like he belonged to any of it.\nCael didn’t hear the footsteps. Just felt the weight of someone behind him. A familiar shadow stretched beside his own.\n“Brooding this early?” came Joffrey’s voice—dry, amused, and already half-tired of the day.\nCael didn’t turn. “Just thinking,” he said nonchalantly.\nJoffrey stepped closer and handed him a thin folder. “Your clearance tag’s inside. Tomorrow morning, you report to Gate Two. You’ll be meeting Melody Lindon.”\nCael blinked. “Wait—my joining date was the day after to—”\nJoffrey cut him off. “Plans changed. Melody’s the shift supervisor down there. She’s agreed to give you a walk-through—get you familiar with the rules, protocols, and layout. Think of it as... orientation before the real work begins.”\nCael's breath hitched, stunned for a second, unsure how to respond.\n“Pick up supplies from the market. Boots, gloves, anything you’re missing. Go to Stall Eight in the East Ring. Ask for Yash. Tell him Joffrey Vannick sent you. He owes me a favor.”\nHis shoulders stiffened. “Yash? I know him.”\nJoffrey turned, just slightly. “You do?”\nCael nodded. “Yeah, Nyra and I both. We hang around his stall sometimes, when we can get away with it. Guards don’t like us talking to him much, so we keep it quiet. He lets us sit behind the crates and mess with old tech. Doesn’t say much, but he listens.”\nJoffrey’s expression flickered, something between curiosity and recognition. “Huh,” he said simply. “Well. Guess the kid’s still good for something.”\nA short pause hung in the cold.\nThen Cael’s voice dropped. “You think my parents wanted this for me?”\nJoffrey stared at him for a long moment.\nHe said it softly, almost too soft for the cold wind to carry: “No. But they didn’t get a choice either.” Then he disappeared inside\nCael stayed still for a beat longer, the cold nipping at his fingertips where the steam had stopped. Then he stood, brushed frost from the back of his pants, and began the climb down.\nThe stairwells between housing layers were narrow, rust-bitten things, bolted onto the sides of buildings like afterthoughts. No insulation. No safety rails. Just exposed metal and frost-slicked steps. Cael moved carefully, his boots scuffing against ice patches that could easily take someone’s leg.\nAs he descended, the world of Oris opened wider around him.\nPeople didn’t live in Oris. They endured it.\nVendors arrived every two weeks, hauling in supplies from the outside world—products most residents only ever saw through reinforced crates. They weren’t allowed to speak to people, not really. Every interaction was watched, timed. In by sunrise, out by dusk. No lingering. No questions.\nThey came and went in sealed community transport trucks, unloading under the eyes of depot guards. They stayed for one reason only: Market Days.\nLately, even the vendors have arrived quietly. Some muttered about the sky, how the Moon hadn’t shown for three nights straight in the outer territories. One swore the stars had shifted. Another claimed the sea near the Eastern ports had frozen flat. Most were dismissed as frostbitten nonsense… but the silence that followed them stuck.\nThose two tightly controlled days, forty-eight hours in total, were when the Lower Grid was allowed to cross the river and mingle with the tiers. Two days to move, to barter, to breathe like people again. Not freedom. But close enough.\nCael darted across the snow-caked platform toward the vendors’ line, his boots thudding against rusting steel.\nThe pipes running through the terraces pulsed with warmth beneath the ice, and every few seconds, a hiss of pressure let off steam that curled around Cael’s legs. He weaved through the crowd of adults with hollow cheeks and soot-stained gloves, children with frostbitten noses pressing their faces against vendor crates. The air smelled of boiled metal, burnt meat, and melting snow.\nThe Market Row sat at the meeting point of two housing zones, East Ridge and South Step, right where their borders overlapped. It was the only shared space between sectors, and because of that, it stayed neutral. Tense, but neutral.\nThe air buzzed with low voices, clinking tools, and sharp whistles from guards trying to control the crowd. Every few seconds, steam hissed from pipes that snaked through the terraces, curling around boots and crates like restless fog. Children pressed their faces against vendor crates, noses red with frost, while vendors barked prices over the hum of generator cores.\nOn either side of the market, at the heart of each zone, stood one of Oris’s two massive heat core generators that powered everything from the stairwell lights to the lavatory pipes. Their humming could be felt in the soles of your boots if you stood still long enough.\nCael could see the East Ridge generator looming behind a row of vendor stalls, its turbines spinning slowly and steadily beneath frost-covered mesh. The South Step core wasn’t far either—its exhaust chimneys belching dense, rhythmic clouds of steam that rolled through the corridors like breath from a sleeping giant. The market sat between them.\nThe warmest place in Oris, by design. Not out of kindness, but because both zones wanted a clear path to trade, to control, to monitor. If one generator ever failed, the other could pick up the slack, barely. And in the middle, the people haggled and bartered, their voices rising like steam, fighting for coats, soup tins, and tools sharpened down to metal splinters.\nAfter some time wandering the rows of patched tarps and crackling lanterns, Cael spotted her instantly.\nNyra Vannick.\nShe leaned over a crate of synth-wool jackets, bartering fiercely with a vendor who looked moments from calling the guards. Her black hair was pulled back in a braid, but a few strands had frozen to her cheek. Her eyes flared as she held up the jacket like it was diseased. The wind caught the braid frozen to her cheek, and for a moment, the frost on her skin shimmered like firelight. Cael had seen her angry before, but never like this. She looked ready to torch the world… and beautiful while doing it.\n\"You haggling again?\" Cael said, sidling up beside her.\n“He tried to sell me a coat with a dead rodent sewn into the lining,” she snapped, tossing him a glance that warmed something in his chest. “And you?”\nCael exhaled through his nose. “Joffrey set up a visit for me tomorrow. A walk-through... inside the mines.”\nNyra blinked, then lit up. “Wait. Really? That’s great news!”\nCael tilted his head. “Is it?”\n“Yes! You get to see it before your first shift. Nobody gets that. And dad arranged it? Cael, do you know how hard it is to pull strings like that?”\nCael gave a small shrug, eyes scanning the frost-choked pipes above. “Guess I should be grateful.”\nNyra pulled the coat tighter around her and fell into step beside him as they left the vendor behind. \n“So,” she said, elbowing him gently, “you ready for tomorrow?”\nCael grunted. “I’d rather be doing anything else.”\n“That’s the spirit,” she laughed.\nThey passed a stall stacked with frost-bitten boots, another with jars of pickled roots glowing faintly green in the frostlight. The market shifted here—more shadows, fewer voices. Tarp canopies sagged lower, and the smell of copper and smoke thickened.\n“Dad said to stop by Stall Eight,” Cael said. “Pick up boots and gloves. Told me to use his full name.”\nNyra snorted. “Like Yash needs reminding.”\nCael raised an eyebrow. “He remembers us?”\nNyra gave him a look. “Cael. We spent half our childhood behind his crates. You think he forgot the two kids who hid from guards, stole broken radios, and made up code names for everyone who passed by?”\nCael cracked a smile. “Right. You were Signal Ghost. I was Wrench Boy.”\nShe grinned. “And Yash was just… Yash. Because he never played along.”\nCael squinted upward. “Think he ever noticed the Moon’s been missing?”\nNyra raised an eyebrow. “What?”\n“The past few nights. I keep checking. Just... nothing.”\nShe shrugged. “Maybe it’s hiding. I would, too, if I lived above this place.”\nHe didn’t laugh. Not really. The thought of it still made his chest feel tight.\nThey turned down a narrower lane, where melted snow pooled in the cracks of the metal flooring and the steam drifted heavier from the vents. \n“Weird sky last week,” someone mutters in the market. “No Moon for three nights straight.”\n“Old Meyra says it’s a curse,” a vendor jokes. “Says the Moon blinked out to mark a death.”\nThe humming of the generators dulled to a background throb. Ahead, the scent rolled in burnt pepper and old wires.\n“Found it,” Cael murmured.\nStall Eight sagged between two support beams, the tarp over it patched with soldered vinyl and faded mining banners. A crooked lantern flickered above a crate-counter stacked with tools, boots, and more things no one had names for anymore.\nBehind it stood Yash, grease-smudged forearms, rolled sleeves, and that same unreadable stare. He looked older, maybe a bit heavier, but everything else was the same. That calm weight. That silence said he noticed more than he let on.\nHe didn’t speak. Just leaned on the counter and looked at them.\nThen, as if picking up right where they’d left off, he said flatly, “Wrench Boy. Signal Ghost. Finally back to rob me blind?”\nNyra grinned. “Only if you count rations as currency.”\nCael stepped forward, holding up the folder. “Joffrey Vannick sent me. Said you owe him a favor.”\nYash glanced at the folder, then at Cael’s face.\n“I owe you a pair of boots more than I owe your old man,” he muttered. Then, after a beat: “You still like the insulated kind?”\nCael frowned slightly. “Yeah.”\n“Good. Because your feet always froze first.”\nHe turned and began rummaging behind a wall of supply crates.\nAs Yash wrapped up the boots, Nyra leaned across the counter, voice low but edged with curiosity.  \n“You get any static lately?”  \nYash didn’t answer right away. He just folded a sheet of thermal paper, then said without looking up, “Static’s all I get now.”  \nCael tilted his head. “From where?”  \n“Everywhere,” Yash muttered. “Channels that used to hum steadily, now nothing. Like the world just… unplugged.”\nYash didn’t look up. He just folded the paper, slow and deliberate.\nNyra frowned. “That’s not just broken signals, is it?”\nYash finally looked up. “There’s talk. From vendors. From guards who think no one’s listening. Some say governments are hiding something. Others think the sky’s wrong. Like… something’s out there.”\nCael stepped beside her, his curiosity now sharpened. “Out where?”\nYash finally looked at them, his tone low. “No one agrees. Some say governments are hiding something. That there’s a weapon, something big, being tested in the northern skies. Others say it’s not even man-made.”\nHe shook his head and continued, “First, it was satellite blackouts, then flight restrictions. Then the tide machines started failing. Coastlines stopped sending signals. And that’s when the Moon vanished.”\nCael flinched. “Wait. What?”\nYash nodded slowly. “Three days. No light. No shape. Not here, but in places far from the mines. Only came back after the third night.”\nNyra frowned. “Is it the war?”\nYash nodded once. “Still going. Still quiet on the channels. That’s what’s got people worried. Too quiet. Whole coastlines have gone dark. Supply convoys vanish. Places that used to send reports every hour haven’t said a word in days.”\nCael’s breath hitched. “But... why?”\nYash hesitated. Then said, “Because something’s coming. That’s the word. Everyone’s afraid of something, but no one agrees on what it is.”\nNyra leaned in. “Like what?”\nYash dropped his voice further. “Some say the Moon vanished for three days last week. Completely gone. Not blocked. People are calling it a sign. Some say a meteor did it. Others say the Moon was never ours to begin with.”\nCael straightened. “The Moon? But… I haven’t seen it in three nights either.”\n His brows furrowed. “You’re saying it’s not just here? This is happening everywhere?”\nYash nodded. “Only from certain regions. No light. No shape. And no one’s explaining it. Governments won’t comment. Some news outlets say it’s a weapon test. Others say the world’s ending.”\nNyra’s eyes narrowed. “And the meteor?”\nCael turned to her. “What’s a meteor?”\nNyra (without condescension): “A space rock. I think. Fast. Deadly.”\nYash chuckled, but it was dry. “Big understatement. Think cannonball from space. Fast. Loud. Deadly. One article said a massive one’s headed for the planet. Another article said the first one’s lying.”\n“So, which is true?” Cael asked, eyebrows pinched.\nYash shook his head. “That’s the problem. No one knows. Everything sounds like a conspiracy... but something feels off. People out there are acting like it’s already too late. And when the Moon disappears, even the liars get scared.”\nHe was about to say more when he noticed a figure in uniform heading their way.\nYash straightened immediately, grabbed a bundle of thick grey fabric from under the counter, and raised his voice.\n“This new synth-wool just came in! Two-layer blend, really warm. Good for depot shifts or rooftop patrols!”\nThe guard strolled past slowly, watching, but didn’t stop.\nNyra forced a small laugh and picked up a glove. “You think it comes in black?”\n“Only if you ask nicely,” Yash muttered.\nThe moment passed. The guard moved on, and with the tension dissolved, the market's noise seemed to return all at once.\nThey didn’t move just yet.\nNyra tapped a knuckle on the counter. “Hey, did you know it’s Cael’s birthday today?”\nYash looked up, blinked once, then grunted. “Huh. That so?”\nCael shifted awkwardly. “Don’t make a thing out of it.”\nYash scratched his chin, then leaned down and pulled something from under the counter. It wasn’t a tool or gloves; it was a cracked holo-card with faded blue trimming and a picture of a boat painted on the front.\n“Tell you what, Wrench Boy,” he said, sliding it across the counter like it was some sacred voucher. “If you ever wander past the community walls, follow the river downstream. You’ll hit a dock. Ask for the ‘Rust Queen.’ Tell them Yash sent you. They’ll let you on.”\nCael stared at it. “This real?”\nYash didn’t answer right away. Just scratched his chin like the question didn’t deserve one.\nCael stared. “You… own a cruise?”\nYash nodded solemnly. “Technically, she’s a cargo hauler with broken plumbing and two deck chairs, but we call her a cruise on good days.”\nNyra snorted. “That’s the most depressing birthday gift I’ve ever heard.”\nYash shrugged. “Free ride’s a free ride.”\nCael picked up the holo-card like it might disappear. “Wait… can I even leave the mines?”\nYash leaned forward, lowering his voice again. “Technically? No. Realistically? Depends on how much you want it.” He gave Cael a look that wasn’t joking anymore. “Things don’t stay locked forever, Wrench Boy. Even mines.”\nCael tucked the card into his coat. “Thanks, Yash. For… everything.”\nYash gave a small nod. “Happy birthday. Try not to die in there.”\nBy the time Cael and Nyra finished weaving through the last row of dim lanterns and smoke-wrapped stalls, the sky had turned a deep navy. The lights from the generator cores cast long shadows that danced across the upper pipes like ghosts, and steam rose heavier now, fogging the narrow paths with a low, constant hiss.\nThey walked in silence, side by side, the hush between them not heavy, just worn in like old boots.\nWhen they reached home, the door was already unlocked.\nJoffrey stood near the stove, lacing up his boots with mechanical precision. His overcoat, dark and soot-dusted, hung from the back of a chair. The small glow from the wall lamp lit his face in orange slashes, and he looked up as they stepped in.\n“Cutting it close,” he said without looking at the clock.\nCael dropped the bundle from Yash onto the table, unwrapping it. “Got the boots. Gloves too. Yash threw in a liner pack.”\nJoffrey checked the gear with a glance and nodded. “Good. Don’t lose anything. Not easy to get second chances down there.”\nNyra slipped past them and began scooping reheated stew from the pot. Cael sat, the metal chair, cold through his clothes, and dug in once his bowl was full. No one said much during dinner; the clink of spoons and the occasional scrape of a chair filled the space between them.\nJoffrey set the boots down on the table, giving them one last squeeze at the heel. “Good stitching. Yash still remembers what matters.”\nNyra moved around the tiny kitchen space, grabbing bowls without looking up. “He remembers everything. Especially us.”\nJoffrey’s mouth twitched, something almost like a smile. “That stall kept you two out of a lot of trouble.”\n“Or got us into different kinds,” Nyra said lightly, glancing back at him. “You never scolded us for hiding there.”\n“I knew where you were,” Joffrey said simply. Then, after a pause: “And I knew who was watching.”\n* * *\nNyra ladled stew into a bowl, glancing once at Cael’s back as he sat motionless.\n“You never talked about it,” she said quietly. “Why did you trust him?”\nJoffrey looked at the closed door. “Some debts go deeper than credits. You just know who’ll protect your kids when you’re not there.”\nShe nodded. “I think Cael still doesn’t know how much you do for him.”\n“He’s not supposed to,” Joffrey murmured. “Not yet.”\nNyra handed him a bowl without looking up. “Then you better make sure he has time to find out.”\n* * *\nBack at the table, Cael ate slowly, unaware of the words spoken behind the door.\nWhen the bowls were empty and Joffrey stood to grab his coat, he paused at the door.\n“You meet Melody at Gate Two,” he said, fastening his collar. “She doesn’t like being kept waiting. Be early. They remember the ones who are late.”\nCael met his eyes. “I’ll be there.”\nJoffrey gave a final nod. Then, quieter: “Good.”\nThe door shut behind him with a hiss as the night swallowed him into the cold.\nCael was still seated, hands resting on the table, when Nyra stood and began collecting the empty bowls.\n“You should get some sleep,” she said, not looking at him as she stacked the utensils. “You’ve got to be up before first bell.”\nCael moved to stand. “Let me help. You’ve got a shift too, and you always—”\n“I’m used to it,” she cut in gently, flashing him a tired smile. “You’re the one stepping into the mine gates for the first time tomorrow. That matters more.”\nCael hesitated, then sank back into the chair. “Still feels like I should be doing something.”\n“You are,” she said, walking toward the washbasin with the bowls. “You’re surviving. That’s more than enough for one night.”\nThe sound of water trickling from the overhead pipe filled the silence as Nyra rinsed each piece with methodical ease. Cael watched her for a moment longer, her movements precise, calm, as if this routine was armor too.\nThen he stood slowly and moved toward his cot.\n“I’ll try,” he murmured. “To sleep.”\nNyra glanced over her shoulder. “Try hard. The mines don’t wait.”\nCael lay still, the thin blanket pulled up to his chin.\nFrom his coat pocket, he slid out the holo-card and turned it over in his fingers.\nThe Rust Queen. He didn’t know if it was real. But he tucked it back carefully. Just in case.\nHe closed his eyes, the cold settling around him like a second skin, and waited for morning to find him.",
      "publishDate": "2025-08-10T04:35:47.639Z",
      "isPublished": false,
      "memberOnly": false,
      "views": 0
    },
    {
      "id": "chapter-1754800583906",
      "title": "Chapter 2:  Echoes in the Smoke",
      "volume": "Volume 1",
      "content": "\nIt began with warmth.\nThe kind that wrapped around Cael like his mother’s shawl. Thick and soft, with the faint scent of burnt sugar. But beneath it, something metallic lurked, like wires left too long on a stove. But it didn’t hurt. Not yet.\nHe tapped a rhythm with his heels against the chair leg, made-up music only he could hear. In his head, it had a name. His mother hummed from the kitchen, just beyond the curtain. His father’s boots were by the door. The fire crackled.\nHe was six. And the world, for a moment, was kind.\nThen came the knock.\nThree short raps.\nLike a question.\nEverything slowed. The humming stopped. The warmth pulled away like a retreating tide.\nHis mother’s shadow flickered in the curtain’s glow. She didn’t call his name. Just moved to the door without a sound. His father stood too, hands stiff by his sides.\nThey opened it together.\nTwo shapes stood there. Framed in frostlight. Silent.\nOne was tall and thin, its head tilted too far like it was listening through walls. Its limbs dangled like frayed rope. The snow around it spiraled upward, never touching it, as if the world rejected its weight.\nThe other was thick and slumped, built like a soaked sack. Its skin didn’t look like skin, more like cloth soaked in oil and stitched too tightly. Beneath it, something shifted, too fluid, too alive.\nNeither spoke. Neither moved.\nHis mother’s hand shot out and slammed the door.\nHis father was already moving. Grabbed Cael. Whispered nothing. Just held him.\nThen came the sound.\nNot from outside, but from beneath. A low, wet groan, like something alive crawling through the frozen earth.\nLights blinked out. The fire stuttered. The metal floor throbbed underfoot. Cael’s breath curled in the dark like a fading ribbon. The knock came again. But not from the door this time. From the wall.\nCael was shoved into a crawl hatch. His mother’s hands were trembling. His father’s face was lit by a red flare, his mining torch already burning.\nThen, the back wall shattered. Not exploded, shattered. Like glass giving up.\n And the two figures stepped through like the cold had opened a door just for them.\nOne reached for his father. The tall one. Its hand bent wrong, spiraled like wire. No sound. Just the motion.\nHis father didn’t scream. He stood his ground. His light burned brighter.\nHis mother turned once toward Cael, eyes wide, her lips forming a shape he couldn’t hear. Then the thick one moved toward her, rippling under its skin.\nThe hatch door slammed shut.\nHe could only see light after that. Red flares. Then white. Then none.\nAnd just before it all went dark, A face appeared at the grate.\nNot human.\nNot anything.\nThe tall one. Its face leaned close. Too close.\nBent at an angle, bones weren’t meant to follow.\nIt waited. Not blinking.\nNot breathing.\nAnd then, it smiled.\nCael gasped, woke up, and sat on the bed, breath sharp and raw in his throat. The cold was back. Harsh. Real. He stared at the ceiling, heart pounding like it was trying to dig through his ribs.\nHis breath came fast, coiling like steam in the stale morning air. The cot creaked beneath him. A distant pipe hissed like someone whispering just out of reach.\nHe wiped his face with trembling hands. The dream still clung to the edges of his vision, like frost on glass that wouldn’t melt. Not a dream. A memory. Twisted. Distorted. But real. That knock. That face. That smile.\nHe pulled the thin blanket tighter, but it didn’t help. The warmth was long gone.\nSomewhere above, a chime rang, low and distant. The first bell. His shift hadn’t started yet, but Oris didn’t care about sleep or dreams. It cared about movement. Punctuality. Survival.\nHe leaned forward, elbows on knees, and rested his face in his palms. He tried not to think of the hatch door. Tried not to think of the hands. But the silence pressed against him. Thick. Expectant.\nA soft knock tapped on the metal wall beside his bed, once, twice. His breath caught. But then a voice followed.\n“You awake?” Nyra shouted in a low voice.\nCael exhaled, long and shaky. “Yeah.”\nThe door creaked open, just enough for her face to peek through. Her braid was undone, her hair loose and static from the pillow. “You slept?”\n“Not well,” he said.\nShe didn’t ask why. Just nodded and disappeared behind the curtain.\nHe stepped to the corner basin, splashed cold water over his face, and scrubbed the sleep from his eyes. The cracked mirror above showed a boy still half-lost in last night’s dreams. He didn’t look for long.\nHe tugged on the thick liner shirt Yash gave him. The fabric itched like it had been boiled in salt, but it was warm.\nThe smell of reheated stew drifted in from the other side. Moments later, Nyra returned and slid a bowl across the table.\n“Eat quickly. You’ve got to be at Gate Two before the second bell.”\nCael nodded, sitting down.\nShe studied him as he picked at the broth. “You look worse than yesterday.”\nHe didn’t answer.\nNyra leaned forward slightly. “What is it this time, mines or them?”\nCael froze, spoon halfway to his mouth.\nShe lowered her voice. “The dream.”\nHe nodded, barely saying “Them”.\nNyra didn’t press. “You need to focus now,” she said gently. “They’ll watch you down there. First impressions matter.”\n“I know,” he muttered.\nHe reached into his coat pocket and pulled out the cracked holo-card Yash had given him. It shimmered faintly in the grey light.\nNyra raised an eyebrow. “You thinking of taking a cruise?”\nCael smirked weakly. “Just wondering if it’s even real.”\n“Hope it is,” she said. “You could use something good at the end of this road.”\nCael tucked it back inside and pushed his chair back. “Let’s see how far the road even goes.”\nShe handed him his gloves as he stood. “You’ll be fine.”\nCael nodded, sliding them on. The silence between them wasn’t heavy - it was worn, like the rest of Oris. Familiar.\nNyra grabbed her coat from the hook and slung it over her shoulder. “Come on. We’re both late.”\nThey stepped to the door together. She opened it, and the cold swept in like a living thing. Outside, the smoke-veiled tiers of Oris were already groaning to life.\nNeither of them spoke. They didn’t need to.\nAfter reaching the generator, Nyra adjusted her coat and pointed across the steam-veiled plaza. “Watchtower’s that way. You take the left street, and you’ll hit Gate Two before the end of the row.”\nCael nodded, then watched as she turned and disappeared into the thinning crowd.\nHe headed the opposite way, boots crunching over the frost-bitten grating.\nThe closer he got, the more the air shifted, colder, sharper, like even the wind didn’t dare hang around too long. And then he saw it.\nThe Watchtower.\nIt rose like a spear through the haze, colossal, brutal, and indifferent. Thirty kilometers in radius, fifty meters tall, it wasn’t just a lookout post. It was a fortress. Its spine was threaded with power lines that hummed faintly even from here, feeding into the far corners of Oris like nerves from a brain. Thick pipes curled up the side, carrying steam, and pressure. Above, metal walkways circled the upper decks, where armed silhouettes moved like ghosts behind railings.\nCael had only seen it from a distance before because only mining workers were allowed past the market. Up close, it was something else. It didn’t watch the city. It owned it.\nOne of the few buildings completely under military control.\nAs he approached, boots echoing off metal grates, Cael held out the clearance badge Joffrey had given him. The nearest guard, stoic behind a black gas mask, glanced once, scanned it with a silent nod, and waved him through without a word. The barrier creaked open, revealing the street to Gate Two.\nThe air changed again.\nFewer vendors here. Fewer people. The laughter, the noise, and even the smoke from the market were gone. Replaced by stark silence and the low hiss of pressure valves in the distance. The towers here were different, built from black steel and outfitted with coils and cameras that tracked every blink. The walkway narrowed between thick walls until Cael saw it up ahead: Gate Two.\nIt was enormous.\nThe first thing that greeted him was a perfunctory medical check. A brass-plated automaton buzzed from its ceiling rail, gears clicking beneath its rounded casing. A single red lens pulsed as it scanned his vitals, then flicked green with a soft chime. With a hiss of steam, it rolled away. That’s when he saw the real barrier.\nA colossal, military-grade steel door loomed before him, scarred from decades of use, if not more. It looked less like a gate and more like a tomb seal. Three more stood to the sides, identical and silent, like giants waiting their turn to breathe.\nEach gate was manned by four guards with gas masks, rifles slung tight, and not an inch of skin visible. They didn’t move like people. They moved like parts of a system. Fluid. Choreographed.\nElectronic scanners buzzed to life as Cael approached. One guard raised a gloved hand, palm flat, then dropped it to reveal a black metal box embedded in the checkpoint post.\nBeside it hovered a copper-bodied automaton, its wings flapping with an uneven tick-tick-tick of steam pistons. A single orange lens on its front pulsed once. Watching.\n“Insert the left hand,” it said in a smooth, clipped synthetic voice.\nCael hesitated, then obeyed. The moment his skin met the panel, a sharp sting struck his wrist. He winced. A black band coiled tight around his arm like a heated wire, locking in place with a hiss.\nThe scanner above flashed green.\nA humming metal detector buzzed around his waist, and the platform beneath him vibrated gently, rising. Slowly, it lifted him about a meter and a half until he stood eye-level with the next barrier: a narrow vertical segment in the gate.\nA sharp swoosh broke the silence. The metal slit opened just wide enough for a person to squeeze through. Cael hesitated, then stepped inside. And stopped.\nA vast, echoing chamber unfolded before him. Shadows swallowed the ceiling. Massive gears turned along the far walls, each the size of a house. Steam curled from pipes overhead. The whole room thrummed like a sleeping beast.\nFour enormous, hall-like rooms branched out from the central space, each sealed off by thick, elevator-style lift doors. In front of them stood lines of people, dozens, waiting without speaking. They were grouped by the colored bands wrapped tightly around their wrists. Yellow. Blue. Red. Green.\nCael glanced down. His own was black.\nBefore he could ask what it meant, a voice cut through the air.\n“Cael Rhane?”\nHe turned.\nA woman stood with arms crossed, wrapped in a faded grey coat lined with reinforced padding. Her expression was sharp but not unkind. Hair tied back in a no-nonsense braid. Utility gloves. No badge.\n“Melody Lindon,” the woman said, without breaking stride. “You’re early. Good.”\nCael opened his mouth to respond, but she was already walking.\n“Keep up,” she snapped. “I’m not slowing down just because you’re Joffrey’s kid.”\nHe followed, boots echoing against the metal beside hers, deeper into the gut of the mine. The hallway opened into a chamber flanked by enormous hall-sized doors. One of them had a smaller side unit, a square elevator carved into the wall, compact and clinical.\nThey stepped in.\nInside, only two buttons. No labels. Just a card scanner and silence.\nMelody scanned her badge. The light blinked blue. She pressed the lower button.\nWith a sharp hiss, the doors sealed, and the platform jolted into motion, descending with a hum that vibrated through Cael’s spine.\nShe didn’t look at him when she spoke again.\n“We don’t get visitors down here,” she said. “So let’s make this clear. You follow every instruction. From me, or whoever’s assigned to you. No exceptions. Got it?”\nCael straightened. “Yes, ma’am.”\nThe rest of the ride was silent.\nThen, with a pressurized hiss, the doors parted again. The corridor opened into a massive bay.\nCael stepped inside and stopped.\nBefore them stretched another immense hall, this one colder, louder, and alive with the pulse of deep machinery. Sparks flickered in distant corners. Steam coiled up from the floor grates. \nThree massive, eclipse-shaped openings broke the far wall. Not ordinary doors, these weren’t meant for people. They looked like wounds carved into the structure itself, wide and yawning, with heavy conveyor belts trailing from each like mechanical tongues.\nLong rows of cavernous stations lined the walls, thirty-one in total, each framed in reinforced concrete and steel. But most of them were empty.\nJust six of the massive machines remained, hulking constructs shaped like sleeping beasts, eighteen meters long with multi-jointed arms built for tunneling. Their armor was dust-caked, streaked with soot and mineral oil. Sparks flared from one, where two technicians welded a fresh plate onto its torso.\nMelody kept walking. “These six are Tremor units. The rest are down in the tunnels.”\nCael blinked. “Tremor?”\n“You’ll get to know them. Fast.”\nCael stared at the few remaining machines, trying to imagine thirty-one of them moving together. Digging together. Breathing together.\nFrom each station, a conveyor belt sloped upward toward the eclipse-shaped chambers in the ceiling. Even from here, Cael could see crates strapped tight with blinking clamps, each one marked: DMV – Dark Matter Veins.. The mine’s true currency.\nThe belts disappeared into the ceiling, vanishing into the upper levels Cael had come from. Extraction moved up, not out. These weren’t entry points. They were exits, for everything the mines pulled from the deep.\nThe air around the openings shimmered faintly. Heat? Pressure? Or something else entirely.\nHe couldn’t tell.\n“This is the belly of Oris,” Melody said beside him, not slowing. “The surface doesn’t power the city. This does.”\nHe swallowed hard. The air tasted of oil and rusted iron, with something underneath, something burnt and sweet, like scorched sugar and melted skin.\n“Tomorrow,” she added, “you’ll be assigned to one of these.” Melody was still walking. “Keep up.”\nThey moved past a row of idle bays until she stopped abruptly at Station Sixteen.\nThe Tremor unit here was half-dismantled, its left arm raised and locked in place, thick cables snaking from its shoulder into a panel overhead. Sparks danced near its chest, where a welder was sealing fresh plating onto a ruptured seam. The whole thing looked like a wounded animal bracing for another fight.\nMelody raised her voice. “Where’s the team manager?”\nFrom the shadows of the maintenance room stepped a man built like a mining rig himself. Broad shoulders, thick neck, arms crisscrossed with old scars and newer burns. He wore a stained mechanics’ exo-suit, half-zipped, a thermal regulator strapped to his back, and one glove still sparking from calibration checks. His face looked carved out of a concrete square, weathered, and wholly unimpressed.\n“Is it him?” the man asked, voice low and gruff.\nMelody nodded. “You follow him for the day.”\nThen, without waiting for a response, she turned on her heel and walked off, her footsteps already lost in the mechanical pulse of the station.\nThe man sized Cael up with a look that didn’t need words.\n“Nick Gardella,” he said finally, jerking his head toward the Tremor. “That thing’s what’ll keep you alive. If you treat it right.”\nCael opened his mouth, but Nick was already walking toward the machine.\n“Get moving. Shadow me. Don’t touch anything unless I tell you. Don’t ask questions unless they sound smart.”\nCael followed footsteps echoing behind Nick’s heavy stride. Sparks from the Tremor’s maintenance flickered across the floor. The air thickened the closer they got—part heat, part oil, part something Cael couldn’t name yet.\nA voice rang out from behind them. Confident. Unhurried.\n“We’re ready to go, Nick-” the woman paused mid-sentence as she caught sight of Cael.\nShe was lean and sharp-featured, with short-cropped hair and a pale scarf tied around her neck, not for fashion but to block dust. Her jumpsuit was smudged with graphite and burn stains, and the comm device at her collar crackled faintly.\nNick didn’t flinch. “Good,” he said flatly, glancing at the rest of the crew beyond her. “You guys carry on. We’ll go now.”\nHe gave a short nod and gestured for Cael to follow.\nAs they walked, Nick spoke without looking back. “Cristi Dullen. One of the supervisors here.”\nCristi gave him a once-over, then let out a dry snort. “Fantastic. Just what we needed, a rookie tourist on a field trip.”\nShe didn’t wait for a response, just turned and muttered, “Try not to get crushed.”\nThey reached the base of Unit 16. Nestled beneath the maintenance rig, a squat, armored excavation vehicle sat prepped and ready. It wasn’t the Tremor itself, but a smaller shuttle used to descend into the actual excavation path, a crawler used to carry teams to the active zones.\nFour seats. Two in front, two in back. Dull grey plating. Reinforced canopy. Scorch marks along the sides.\nNick opened the side hatch with a grunt. “Get in.”\nCael ducked inside, heart thudding again, not from fear, not quite, but something heavier. The silence of the crawler wrapped around him like pressure.\nOutside, steam hissed from a nearby pipe as Cristi stepped away to check the loadout. Nick climbed into the driver’s seat. The door slammed shut with a hydraulic hiss, sealing them in a tight capsule of steel and shadows.\nNick flicked a few switches. The crawler rumbled to life, its interior bathed in a faint orange glow from the dashboard lights. The cabin smelled of oil, hot metal, and something older—burnt insulation maybe, or dried blood hiding beneath the steel seams.\n“Have you ever been this far down before?” Nick asked, not looking at him.\nCael shook his head. “No.”\n“Good,” Nick muttered, adjusting a lever. “Means you’ve got no illusions.”\nThe crawler lurched forward, the wheels grinding against the grated floor as they slid into a tunnel carved into the rock. Darkness swallowed them almost instantly. The only light came from the crawler’s thin headlights, casting long, skeletal shadows that danced along the tunnel walls.\nCael’s fingers tightened around the edge of his seat.\nThe crawler dipped lower, the tunnel narrowing as faint tremors shook dust from the ceiling.\n“Don’t panic if the lights flicker,” Nick said. “Just means we’re passing through an unstable vein. Electromagnetic surges mess with the grid.”\nSure enough, the headlights dimmed briefly, the dashboard flickering.\nCael glanced toward the window but saw only a black rock flashing by.\n“How deep are we going?” he asked quietly.\n“Bottom of Tier Three. You’ll feel it.”\nThe crawler began to vibrate, subtle at first, then stronger. The hum shifted into a deeper groan. A low, rhythmic thudding echoed from the walls, distant machinery, or something pretending to be.\nNick leaned forward slightly, squinting at the console. “You feel that?”\nCael did. A low pulse, not from the engine or the wheels. It came from beneath. Like the ground itself was breathing.\nThe crawler jerked once, then steadied. A metallic voice crackled over the cabin speaker: “Approaching Drop Core. Prepare for the descent.”\nNick killed the lights.\nTotal black. Then, the floor dropped.\nThe crawler locked into a magnetic rail system and began its final descent - fast, smooth, and impossibly silent.  Then came the glow.\nA pale, sickly blue began to seep through the gloom.\nCael leaned forward.\nWhat opened beneath them wasn’t a cavern. It was a system. Vast. Layered.\nInterconnected shafts, walkways, and support veins stretched into the dark, glowing faintly with maintenance lights and exhaust haze.\nNick spoke, voice quiet now. “Welcome to the Deep Veins.”\nNick stepped off the platform and gestured for Cael to follow. The space around them opened into a vast underground hangar, walls reinforced with thick layers of alloyed concrete and mineral-sealed mesh. Overhead, crane tracks spanned the ceiling like veins across the skin, silent now but still humming faintly with residual charge.\n“This is Bay 2,” Nick said, voice echoing slightly. “One of the Deep Veins' main surveillance areas.”\nNick gestured toward a wall lined with screens, thirty or more, arranged in three rows, each flickering with live feeds from deep inside the mine. Some showed drilling operations. Others displayed thermal maps, pressure graphs, or raw black-and-white footage of narrow tunnels, flickering with static.\n“Every active sector routes through here,” Nick said. “DME activity. Heat bursts. Structural stress. If a tunnel groans, Bay 2 hears it first.”\nCael took a slow step toward the monitors, eyes scanning the footage. Some feeds showed dark corridors, eerily still. Others pulsed with movement - drills, sparks, shadows that might’ve been workers or just shifting machinery.\n“Who watches all this?” he asked quietly.\n“Rotating surveillance crew,” Cristi’s voice cut in behind them. She joined them from the crawler’s rear, suit half unzipped, gloves hanging from her belt. “Some of it's AI-tracked. The rest gets flagged by the grid runners like us.”\nShe tossed him a small headset. “You’ll wear this when you're mapping. Connects you to our line and Bay 2 if the signal holds. Don’t wander off, some tunnels mess with comms.”\nNick pointed to a schematic displayed on the central wall, an animated overlay of the entire lower tier.\n“Tier Three splits into twelve core excavation zones,” he said. “Bay 2 feeds each crew intel - where to drill, what to avoid. Think of it like a nervous system. And we’re the walking nerves.”\nCristi flicked the schematic, zooming in on a newly opened tunnel. “Section 7. Your first walkthrough. Tremor Unit 11 was here last cycle. They cleared debris and tapped a shallow pocket, but the rail anchors weren’t finished. Our job is to mark the safe route and flag any stress lines before the next machine goes in.”\nCael stared at the map. The tunnel spiraled downward, deeper than he’d imagined. The layout reminded him of a coiled serpent, its ribs made of wire and light.\n“Suit up,” Nick said, already walking toward a gear station. “We leave in five.”\nBut Cael was already mesmerized by the sheer technology. The way the tunnels moved, and pulsed on the screen reminded him less of a map and more of a living thing. The lines weren’t just coordinates. They were veins. Arteries. Feeding something.\n“Cael,” Cristi called. “Move.”\nHe blinked, snapping out of it, and followed them toward the gear station. The suit wasn’t like the ones used topside. This one had hardened joints, reinforced boots, and a slim spine harness with a thermal pack and short-range comm relay. Cristi adjusted the oxygen filter on his collar and snapped the visor into place.\n“Keep your airflow steady. These tunnels breathe weird.”\nNick handed him a beacon pouch, six black markers, each no bigger than a matchbox, blinking faintly blue.\n“Anchor one every thirty meters. Leave them in line of sight. That’s how the rail engineers know where to cut and install the tremor tracks.”\nCael nodded.\nThe trio moved toward a sealed blast door at the far end of Bay 2. Red paint marked the doorframe:\n SECTOR 7 – RESTRICTED ACCESS – PRE-RAIL\nCristi scanned her badge. The light turned green.\nA low groan followed as the door peeled open, revealing a descending tunnel bathed in a cold, artificial glow. Pipes twisted through the walls like exposed nerves. The ground was uneven, metal grates over stone, with fragments of old rail anchors half-buried in dust.\nThey stepped inside.\nThe temperature dropped immediately. The silence wasn’t complete, but close. Only the hum of distant pressure valves and the occasional drip of condensation echoed around them.\n“This isn’t a finished corridor,” Nick said. “You’ll see what that means.”\nCristi pulled out her scanner and swept it toward the walls. A light blinked green.\n“Wall stability’s reading clean,” she muttered. “No pulse bleed yet.”\n“Pulse bleed?” Cael asked.\nCristi didn’t look back. “When DME starts leaking into the walls. Makes them soft. Corrupts the rock. You’ll know when you see it. And smell it.”\nThey walked in silence for a while, placing markers at each junction. Cael’s boots echoed louder than theirs, every step a sharp reminder that he was new, both to this job and to the buried world around him.\nThey moved deeper into the corridor, the light from Bay 2 fading behind them. The tunnel sloped gently downward, flanked by support struts bolted into uneven stone. Overhead, pressure lines, and power cables twisted like veins through the ceiling, their insulation glistening faintly with condensation.\nCristi swept her scanner across the left wall and marked a point with chalk. “Fracture zone here. Mark it in the tablet.”\nCael nodded and tapped the location into the map. The display was updated with a soft chime-Zone 7A-3, marked “UNSTABLE-REVIEW.”\nHe glanced up. The fracture wasn’t visible, but he could hear it. A faint crackle, like stone flexing under breath.\n“This whole stretch is going to shift when the next drill hits,” Nick muttered. “Better hope they reinforce it first.”\nThey walked another twenty meters before Nick stopped and dropped to one knee. He pulled a beacon from his pouch and placed it against the floor. It latched into place with a magnetic click, then pulsed blue.\n“That’s anchor point five,” he said. “Keep them in line of sight. Once this path’s certified, the Tremor’s rail will follow the line.”\nCael followed, repeating the process every thirty meters, placing his beacons with stiff, gloved hands. The suit was starting to feel heavy. His shoulders ached from the harness. The air tasted like copper and coal dust.\nThey passed a junction where the tunnel split in two directions. Cristi checked the tablet. “Left’s sealed. Right’s ours.”\nThe right tunnel narrowed, rougher than the others. Less finished. The light strips here were dimmer, and the ground sloped harder. A fine mist clung to the walls, DME residue, maybe, or coolant bleed.\nCael paused.\n“How far does this go?” he asked.\nCristi answered first. “Until the rock tells us to stop.”\nCael looked ahead. The tunnel narrowed, fading into fog and flickering light. Pipes hissed softly above them, the sound rhythmic, like the mine was breathing through iron lungs. He set another beacon down. It blinked blue.\nCristi checked her scanner, brow furrowing as she scanned the static-laced feed. “Signal’s degrading fast. Another ten meters and we’ll be blind.”\nNick gave the tunnel a long look, then turned. “That’s our cut-off. No point charting what we can’t trust. We head back.”\nCael hesitated, eyes lingering on the dark. “Already?”\nCristi clipped the scanner to her belt. “You want your first assignment to end with a retrieval team scraping you off a wall?” She offered a half-smile. “Live maps only matter if you make it back with them.”\nThey turned around, falling into a silent rhythm as they retraced their steps. The hiss of the deeper tunnels faded behind them, replaced by the steadier thrum of overhead power lines and maintenance systems. With every step, the fog thinned, the air less dense, less strange. What had felt like a living thing breathing around them now seemed like it was simply... exhaling.\nEventually, the reinforced walkways gave way to familiar metal platforms. The dull amber lights of Station 16 came into view — a soft, buzzing reminder that they were back on stable ground.\nThe Tremor unit still groaned under partial repair. Sparks flashed near the hull where a welder leaned into the open frame, visor aglow.\nCristi unhooked her scanner. “That’s all for today.”\nNick nodded toward Cael. “You did good, kid. Don’t get yourself killed down there.”\nMelody appears just beyond the Tremor, arms crossed, coat still zipped up to the chin. She scans Cael once, eyes sharp, unreadable.\n“He kept up,” Cristi says flatly, handing her the tablet.\nMelody reviews the entries, beacons logged, and fracture zones marked. She flicks a glance at Cael. “Come with me,” she says simply.\nThey walk together through the lower station, past idle platforms and flickering signs. Cael keeps quiet. “You didn’t ask stupid questions,” Melody says after a while. “That’s rare.”\nCael shrugs. “Didn’t have time.”\nShe doesn’t smile, but there’s something softer in her voice now. “Tomorrow, you’ll be part of the unit. Keep your pace. Trust the beacons. If a tunnel groans, don’t ignore it.”\nThe lift arrives. They step in. As it rises, Cael watches the platforms disappear beneath them like fading memories.\nThe upper gate hisses open. Cold air slams into him. “Report to Gate Four at the second bell,” Melody says. Today was shadow training. Tomorrow, you will join Team 27. Your actual assignment.”\nHe nods, stepping onto the frost-lined grate. Behind him, the gate seals again, swallowing the warmth, the flicker, the hum of the mine.\nAhead, Oris groans to life in the half-light. The Watchtower loomed in the mist, its lights blinking like an eye slowly closing.\nCael pulled his coat tight and started walking. Tomorrow, the real work begins.\nCael walked home in silence, the frostbitten metal grates of Oris groaning beneath each step. The echoes of the Deep Veins hadn’t left him. Even now, out in the open air, he could feel the tunnels breathing. The flare of sparks from Tremor units. The groan of settling stone. The taste of scorched dust clinging to the roof of his mouth.\nHe kept his hands in his pockets, shoulders hunched, eyes half-focused on the mist-wrapped streets ahead. The mine hadn’t scared him—not exactly. But it had unsettled him. Something about the way the corridors pulsed. The way the darkness didn’t end, even when the lights were on. The way silence could stretch until it broke.\nBy the time he reached home, his joints ached, and his thoughts were spiraling inward.\nInside, the smell of something warm and spiced drifted through the air. Nyra was at the stove, stirring with slow, practiced motions.\nShe turned when the door creaked. “You’re back.”\nHe nodded, pulled off his gloves, and sank into the chair nearest the stove. The heat from the coils soaked into his bones. For a moment, he just sat there, silent.\n“How did it go?” she asked.\nHe rubbed his eyes with the back of one hand. “Long. Dust everywhere. I shadowed Unit 16, Nick Gardella, and Cristi Dullen. Just followed them through tunnels. Marked fractures, dropped beacons. Nothing heroic. Just... heavy down there.”\nNyra glanced at him over her shoulder. “Heavy?”\nHe nodded slowly. “The air. The quiet. Like it presses in on you.”\nShe didn’t laugh at that. Just turned back to the pot and gave it one final stir before pulling two dented bowls from the rack.\n“What did they say about your shift?” she asked.\n“I report to Gate Four tomorrow. Team 27.”\nNyra looked up, eyebrows raised. “That’s great. My shift’s at Gate Four too. We can go together.”\nShe ladled thick stew into the bowls and handed one to him. They ate in silence, both too tired for chatter, both grateful for the heat. Cael didn’t realize how hungry he was until the second bite hit his stomach like warmth after cold.\nWhen they were done, Nyra stood and started clearing the dishes.\n“Go to bed soon,” she said, rinsing the bowls. “We need to wake up by first bell. If we’re late, we won’t reach the gate by the second bell.”\nShe shot him a look. “You know how it is, bathrooms will be packed. Everyone from the worker tier and the smokestack tier fights for a spot in the morning.”\nCael smirked faintly. “You’d think they’d add one more washroom.”\n“They did. It broke.”\nHe pushed to his feet. The exhaustion was setting in fast now, like the mine had been waiting for him to sit down before letting it fall on him.\nHe didn’t say goodnight. He didn’t need to.\nThe bed called, and he answered.",
      "publishDate": "2025-08-10T04:36:23.906Z",
      "isPublished": false,
      "memberOnly": false,
      "views": 0
    }
  ]
}